/**********************************************************************************
*项目代码名称：HOTAS
*版本号：V1.0
*创建日期：2013-2-4
*创建人：huo
*模块功能：硬件延时模块，使用SysTick的普通计数模式对延迟进行管理
*修改日期：2013-3-7
*参考文档：《STM32F103数据手册》《AD8630数据手册》《AD7888数据手册》
*工作平台及编译器和编译开关：KeilV4.10
***********************************************************************************/

//**********************************头文件************************************
#ifndef __DELAY_H
#define __DELAY_H 			   
#include <stm32f10x.h>

//********************************延时相关函数*************************************
void delay_init(u8 SYSCLK);		  //延时初始化
void delay_ms(u16 nms);			  //延时ms
void delay_us(u32 nus);			  //延时us
#endif





























